//////////////////////////////////////////////////////////////////////////////////
//              Title:  ShaderMath.hlsli
//            Content:  シェーダーで使用する数学関数をまとめています.
//             Author:  Toide Yutaro
//             Create:  2020_04_24
//////////////////////////////////////////////////////////////////////////////////
#ifndef SHADER_MATH_HLSLI
#define SHADER_MATH_HLSLI

//////////////////////////////////////////////////////////////////////////////////
//                             Include
//////////////////////////////////////////////////////////////////////////////////


//////////////////////////////////////////////////////////////////////////////////
//                             Define
/////////////////////////////////////////////////////////////////////////////////

//////////////////////////////////////////////////////////////////////////////////
//                            Implement
//////////////////////////////////////////////////////////////////////////////////

/*!**********************************************************************
*  @brief     Vectorクラスに対して, 各要素の総和を取得します.
*  @param[in] const float3 vector
*  @return    void
*************************************************************************/
float ElementSum(const float2 elements)
{
    return elements.x + elements.y;
}

/*!**********************************************************************
*  @brief     Vectorクラスに対して, 各要素の総和を取得します.
*  @param[in] const float3 vector
*  @return    void
*************************************************************************/
float ElementSum(const float3 elements)
{
    return elements.x + elements.y + elements.z;
}

/*!**********************************************************************
*  @brief     Vectorクラスに対して, 各要素の総和を取得します.
*  @param[in] const float4 vector
*  @return    void
*************************************************************************/
float ElementSum(const float4 elements)
{
    return elements.x + elements.y + elements.z + elements.w;
}
#endif