//////////////////////////////////////////////////////////////////////////////////
///  @file   WindowsCommonState.hpp
///  @brief  temp
///  @author toide
///  @date   2024/06/30 11:35:03
//////////////////////////////////////////////////////////////////////////////////
#pragma once
#ifndef WINDOWS_COMMON_STATE_HPP
#define WINDOWS_COMMON_STATE_HPP

//////////////////////////////////////////////////////////////////////////////////
//                             Include
//////////////////////////////////////////////////////////////////////////////////
#include "GameUtility/Base/Include/GUString.hpp"
#include "GameUtility/Container/Include/GUDynamicArray.hpp"

//////////////////////////////////////////////////////////////////////////////////
//                              Define
//////////////////////////////////////////////////////////////////////////////////

//////////////////////////////////////////////////////////////////////////////////
//                               Class
//////////////////////////////////////////////////////////////////////////////////

namespace platform::windows::details
{
	/****************************************************************************
	*				  	DragDropOperationType
	****************************************************************************/
	/* @brief  ドラッグドロップの種類
	*****************************************************************************/
	enum class DragDropOperationType
	{
		DragEnter, //!< ドラッグ開始
		DragOver,  //!< ドラッグ中
		DragLeave, //!< ドラッグ終了
		Drop,      //!< ドロップ操作
	};

	/****************************************************************************
	*				  	DragDropOLEData   
	****************************************************************************/
	/* @brief  ドラッグドロップをしたときに確保するデータ
	*****************************************************************************/
	struct DragDropOLEData
	{
		enum WindowsOLEDataType
		{
			None  = 0,
			Text  = 1<<0,
			Files = 1<<1
		};

		/*! @brief 操作時のテキスト*/
		gu::tstring TextString = SP("");

		/*! @brief 操作しているファイル名*/
		gu::DynamicArray<gu::tstring> FileNameList = {};

		/*! @brief 種類*/
		gu::uint8 TypeFlag = WindowsOLEDataType::None;
	};
}


#endif